# YOLO11-SPD-BMSSPPF-P2
# Shared backbone for the Dual-Path Road Infrastructure Analytics system.
#   • SPD-Conv (Focus proxy) replaces strided convolutions → no small-object erasure.
#   • BMS-SPPF (Focus2 proxy) replaces standard SPPF for crack + pothole awareness.
#   • Extra P2 detection head (stride 4, 160×160) captures details at 40 m range.
#   • 4-head Detect (P2/P3/P4/P5) for full-scale coverage.

nc: 4  # RDD2022 classes: D00, D10, D20, D40
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, n, module, args]
  - [-1, 1, Focus,  [64]]        # 0-P1/2  → SPDConv proxy
  - [-1, 1, Focus,  [128]]       # 1-P2/4  → SPDConv proxy
  - [-1, 2, C3k2,   [256, False, 0.25]]   # 2
  - [-1, 1, Focus,  [256]]       # 3-P3/8  → SPDConv proxy
  - [-1, 2, C3k2,   [512, False, 0.25]]   # 4
  - [-1, 1, Conv,   [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2,   [512, True]] # 6
  - [-1, 1, Conv,   [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2,   [1024, True]] # 8
  - [-1, 1, SPPF,   [1024, 5]]   # 9  → BMS-SPPF (bidirectional multi-scale pooling)
  - [-1, 2, C2PSA,  [1024]]      # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12 cat P4
  - [-1, 2, C3k2, [512, False]]                # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15 cat P3
  - [-1, 2, C3k2, [256, False]]                # 16 (P3/8-small)

  # ── P2 branch (tiny / 40 m objects) ─────────────────────────────────────
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [[-1, 2], 1, Concat, [1]]                  # 18 cat P2 features
  - [-1, 2, C3k2, [128, False]]                # 19 (P2/4-tiny)

  # ── Bottom-up path ────────────────────────────────────────────────────────
  - [-1, 1, Conv, [128, 3, 2]]                 # 20
  - [[-1, 16], 1, Concat, [1]]                 # 21 cat P3 head
  - [-1, 2, C3k2, [256, False]]                # 22 (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]                 # 23
  - [[-1, 13], 1, Concat, [1]]                 # 24 cat P4 head
  - [-1, 2, C3k2, [512, False]]                # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 26
  - [[-1, 10], 1, Concat, [1]]                 # 27 cat P5 head
  - [-1, 2, C3k2, [1024, True]]                # 28 (P5/32-large)

  - [[19, 22, 25, 28], 1, Detect, [nc]]        # Detect(P2, P3, P4, P5)
